---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarTrimExtendData.CanAddBarGeometry
source: html/4dc39ffe-585f-9f4f-725c-5269d71bfc1e.htm
---
# Autodesk.Revit.DB.Structure.RebarTrimExtendData.CanAddBarGeometry Method

Returns true if getNumberOfBarGeometry() is less than GetNumberOfBars(), false otherwise.

## Syntax (C#)
```csharp
public bool CanAddBarGeometry()
```